using System.Collections.Generic;

namespace VOR.Helpers
{
    public class Constants
    {
        public static readonly Dictionary<(string Brand, int NumberCores, double CrossSection), double> cableWeightDictionary = new Dictionary<(string Brand, int NumberCores, double CrossSection), double>()
        {
            #region Алюминиевые небронированные кабели АВВГнг(А)
            // Алюминиевые небронированные кабели АВВГнг(А)
            { ("АВВГнг(А)", 3, 2.5), 0.125 },
            { ("АВВГнг(А)", 3, 4), 0.165 },
            { ("АВВГнг(А)", 3, 6), 0.202 },
            { ("АВВГнг(А)", 3, 10), 0.295 },
            { ("АВВГнг(А)", 3, 16), 0.421 },
            { ("АВВГнг(А)", 3, 25), 0.698 },
            { ("АВВГнг(А)", 3, 35), 0.862 },
            { ("АВВГнг(А)", 3, 50), 1.153 },
            { ("АВВГнг(А)", 3, 70), 1.220 },
            { ("АВВГнг(А)", 3, 95), 1.666 },
            { ("АВВГнг(А)", 3, 120), 1.941 },
            { ("АВВГнг(А)", 3, 150), 2.360 },
            { ("АВВГнг(А)", 3, 185), 2.903 },
            { ("АВВГнг(А)", 3, 240), 3.356 },

            { ("АВВГнг(А)", 4, 2.5), 0.144 },
            { ("АВВГнг(А)", 4, 4), 0.191 },
            { ("АВВГнг(А)", 4, 6), 0.236 },
            { ("АВВГнг(А)", 4, 10), 0.347 },
            { ("АВВГнг(А)", 4, 16), 0.497 },
            { ("АВВГнг(А)", 4, 25), 0.847 },
            { ("АВВГнг(А)", 4, 35), 1.032 },
            { ("АВВГнг(А)", 4, 50), 1.421 },
            { ("АВВГнг(А)", 4, 70), 1.625 },
            { ("АВВГнг(А)", 4, 95), 2.097 },
            { ("АВВГнг(А)", 4, 120), 2.499 },
            { ("АВВГнг(А)", 4, 150), 3.012 },
            { ("АВВГнг(А)", 4, 185), 3.673 },
            { ("АВВГнг(А)", 4, 240), 4.623 },

            { ("АВВГнг(А)", 5, 2.5), 0.169 },
            { ("АВВГнг(А)", 5, 4), 0.227 },
            { ("АВВГнг(А)", 5, 6), 0.286 },
            { ("АВВГнг(А)", 5, 10), 0.419 },
            { ("АВВГнг(А)", 5, 16), 0.596 },
            { ("АВВГнг(А)", 5, 25), 0.998 },
            { ("АВВГнг(А)", 5, 35), 1.230 },
            { ("АВВГнг(А)", 5, 50), 1.735 },
            { ("АВВГнг(А)", 5, 70), 1.955 },
            { ("АВВГнг(А)", 5, 95), 2.600 },
            { ("АВВГнг(А)", 5, 120), 3.113 },
            { ("АВВГнг(А)", 5, 150), 3.755 },
            { ("АВВГнг(А)", 5, 185), 4.634 },
            { ("АВВГнг(А)", 5, 240), 5.647 },
            #endregion

            #region Контрольные алюминиевые небронированные кабели АКВВГнг(А)
            // Контрольные алюминиевые небронированные кабели АКВВГнг(А)
            { ("АКВВГнг(А)", 4, 2.5), 0.100 },
            { ("АКВВГнг(А)", 5, 2.5), 0.122 },
            { ("АКВВГнг(А)", 7, 2.5), 0.146 },
            { ("АКВВГнг(А)", 10, 2.5), 0.200 },
            { ("АКВВГнг(А)", 14, 2.5), 0.254 },
            { ("АКВВГнг(А)", 19, 2.5), 0.323 },
            { ("АКВВГнг(А)", 27, 2.5), 0.459 },
            { ("АКВВГнг(А)", 37, 2.5), 0.616 },
            #endregion

            #region Алюминиевые бронированные кабели АВБШвнг(А)
            // Алюминиевые бронированные кабели АВБШвнг(А)
            { ("АВБШвнг(А)", 3, 2.5), 0.316 },
            { ("АВБШвнг(А)", 3, 4), 0.352 },
            { ("АВБШвнг(А)", 3, 6), 0.407 },
            { ("АВБШвнг(А)", 3, 10), 0.533 },
            { ("АВБШвнг(А)", 3, 16), 0.705 },
            { ("АВБШвнг(А)", 3, 25), 0.922 },
            { ("АВБШвнг(А)", 3, 35), 1.122 },
            { ("АВБШвнг(А)", 3, 50), 1.454 },
            { ("АВБШвнг(А)", 3, 70), 1.538 },
            { ("АВБШвнг(А)", 3, 95), 2.035 },
            { ("АВБШвнг(А)", 3, 120), 2.344 },
            { ("АВБШвнг(А)", 3, 150), 2.812 },
            { ("АВБШвнг(А)", 3, 185), 3.402 },
            { ("АВБШвнг(А)", 3, 240), 4.476 },

            { ("АВБШвнг(А)", 4, 2.5), 0.320 },
            { ("АВБШвнг(А)", 4, 4), 0.394 },
            { ("АВБШвнг(А)", 4, 6), 0.458 },
            { ("АВБШвнг(А)", 4, 10), 0.606 },
            { ("АВБШвнг(А)", 4, 16), 0.809 },
            { ("АВБШвнг(А)", 4, 25), 1.107 },
            { ("АВБШвнг(А)", 4, 35), 1.319 },
            { ("АВБШвнг(А)", 4, 50), 1.759 },
            { ("АВБШвнг(А)", 4, 70), 1.994 },
            { ("АВБШвнг(А)", 4, 95), 2.511 },
            { ("АВБШвнг(А)", 4, 120), 2.951 },
            { ("АВБШвнг(А)", 4, 150), 3.511 },
            { ("АВБШвнг(А)", 4, 185), 4.586 },
            { ("АВБШвнг(А)", 4, 240), 5.618 },

            { ("АВБШвнг(А)", 5, 2.5), 0.359 },
            { ("АВБШвнг(А)", 5, 4), 0.447 },
            { ("АВБШвнг(А)", 5, 6), 0.520 },
            { ("АВБШвнг(А)", 5, 10), 0.702 },
            { ("АВБШвнг(А)", 5, 16), 0.962 },
            { ("АВБШвнг(А)", 5, 25), 1.284 },
            { ("АВБШвнг(А)", 5, 35), 1.547 },
            { ("АВБШвнг(А)", 5, 50), 2.109 },
            { ("АВБШвнг(А)", 5, 70), 2.358 },
            { ("АВБШвнг(А)", 5, 95), 3.063 },
            { ("АВБШвнг(А)", 5, 120), 3.634 },
            { ("АВБШвнг(А)", 5, 150), 4.694 },
            { ("АВБШвнг(А)", 5, 185), 5.666 },
            { ("АВБШвнг(А)", 5, 240), 6.753 },
            #endregion

            #region Контрольные алюминиевые бронированные кабели АКВБбШвнг(А)
            // Контрольные алюминиевые бронированные кабели АКВБбШвнг(А)
            { ("АКВБбШвнг(А)", 4, 2.5), 0.294 },
            { ("АКВБбШвнг(А)", 5, 2.5), 0.328 },
            { ("АКВБбШвнг(А)", 7, 2.5), 0.368 },
            { ("АКВБбШвнг(А)", 10, 2.5), 0.465 },
            { ("АКВБбШвнг(А)", 14, 2.5), 0.540 },
            { ("АКВБбШвнг(А)", 19, 2.5), 0.639 },
            { ("АКВБбШвнг(А)", 27, 2.5), 0.813 },
            { ("АКВБбШвнг(А)", 37, 2.5), 0.1015 },
            #endregion

            #region Медные небронированные кабели ВВГнг(А)
            // Медные небронированные кабели ВВГнг(А)
            { ("ВВГнг(А)", 3, 1.5), 0.130 },
            { ("ВВГнг(А)", 3, 2.5), 0.171 },
            { ("ВВГнг(А)", 3, 4), 0.238 },
            { ("ВВГнг(А)", 3, 6), 0.311 },
            { ("ВВГнг(А)", 3, 10), 0.475 },
            { ("ВВГнг(А)", 3, 16), 0.714 },
            { ("ВВГнг(А)", 3, 25), 1.158 },
            { ("ВВГнг(А)", 3, 35), 1.488 },
            { ("ВВГнг(А)", 3, 50), 2.101 },
            { ("ВВГнг(А)", 3, 70), 2.489 },
            { ("ВВГнг(А)", 3, 95), 3.388 },
            { ("ВВГнг(А)", 3, 120), 4.144 },
            { ("ВВГнг(А)", 3, 150), 5.101 },
            { ("ВВГнг(А)", 3, 185), 6.300 },
            { ("ВВГнг(А)", 3, 240), 7.930 },

            { ("ВВГнг(А)", 4, 1.5), 0.153 },
            { ("ВВГнг(А)", 4, 2.5), 0.204 },
            { ("ВВГнг(А)", 4, 4), 0.288 },
            { ("ВВГнг(А)", 4, 6), 0.380 },
            { ("ВВГнг(А)", 4, 10), 0.587 },
            { ("ВВГнг(А)", 4, 16), 0.888 },
            { ("ВВГнг(А)", 4, 25), 1.461 },
            { ("ВВГнг(А)", 4, 35), 1.867 },
            { ("ВВГнг(А)", 4, 50), 2.686 },
            { ("ВВГнг(А)", 4, 70), 3.317 },
            { ("ВВГнг(А)", 4, 95), 4.393 },
            { ("ВВГнг(А)", 4, 120), 5.436 },
            { ("ВВГнг(А)", 4, 150), 6.666 },
            { ("ВВГнг(А)", 4, 185), 8.202 },
            { ("ВВГнг(А)", 4, 240), 10.445 },

            { ("ВВГнг(А)", 5, 1.5), 0.182 },
            { ("ВВГнг(А)", 5, 2.5), 0.245 },
            { ("ВВГнг(А)", 5, 4), 0.348 },
            { ("ВВГнг(А)", 5, 6), 0.467 },
            { ("ВВГнг(А)", 5, 10), 0.718 },
            { ("ВВГнг(А)", 5, 16), 1.085 },
            { ("ВВГнг(А)", 5, 25), 1.766 },
            { ("ВВГнг(А)", 5, 35), 2.274 },
            { ("ВВГнг(А)", 5, 50), 3.316 },
            { ("ВВГнг(А)", 5, 70), 4.071 },
            { ("ВВГнг(А)", 5, 95), 5.470 },
            { ("ВВГнг(А)", 5, 120), 6.785 },
            { ("ВВГнг(А)", 5, 150), 8.323 },
            { ("ВВГнг(А)", 5, 185), 10.295 },
            { ("ВВГнг(А)", 5, 240), 12.925 },
            #endregion

            #region Контрольные медные небронированные кабели КВВГнг(А)
            // Контрольные медные небронированные кабели КВВГнг(А)
            { ("КВВГнг(А)", 4, 1.0), 0.086 },
            { ("КВВГнг(А)", 5, 1.0), 0.116 },
            { ("КВВГнг(А)", 7, 1.0), 0.140 },
            { ("КВВГнг(А)", 10, 1.0), 0.193 },
            { ("КВВГнг(А)", 14, 1.0), 0.249 },
            { ("КВВГнг(А)", 19, 1.0), 0.321 },
            { ("КВВГнг(А)", 27, 1.0), 0.440 },
            { ("КВВГнг(А)", 37, 1.0), 0.597 },

            { ("КВВГнг(А)", 4, 1.5), 0.108 },
            { ("КВВГнг(А)", 5, 1.5), 0.142 },
            { ("КВВГнг(А)", 7, 1.5), 0.177 },
            { ("КВВГнг(А)", 10, 1.5), 0.244 },
            { ("КВВГнг(А)", 14, 1.5), 0.320 },
            { ("КВВГнг(А)", 19, 1.5), 0.415 },
            { ("КВВГнг(А)", 27, 1.5), 0.589 },
            { ("КВВГнг(А)", 37, 1.5), 0.776 },

            { ("КВВГнг(А)", 4, 2.5), 0.161 },
            { ("КВВГнг(А)", 5, 2.5), 0.198 },
            { ("КВВГнг(А)", 7, 2.5), 0.252 },
            { ("КВВГнг(А)", 10, 2.5), 0.351 },
            { ("КВВГнг(А)", 14, 2.5), 0.466 },
            { ("КВВГнг(А)", 19, 2.5), 0.611 },
            { ("КВВГнг(А)", 27, 2.5), 0.868 },
            { ("КВВГнг(А)", 37, 2.5), 1.177 },

            { ("КВВГнг(А)", 4, 4.0), 0.232 },
            { ("КВВГнг(А)", 5, 4.0), 0.288 },
            { ("КВВГнг(А)", 7, 4.0), 0.371 },
            { ("КВВГнг(А)", 10, 4.0), 0.521 },
            { ("КВВГнг(А)", 14, 4.0), 0.717 },
            { ("КВВГнг(А)", 19, 4.0), 0.943 },
            { ("КВВГнг(А)", 27, 4.0), 1.334 },
            #endregion

            #region Контрольные медные экранированные небронированные кабели КВВГЭнг(А)
            // Контрольные медные небронированные кабели КВВГЭнг(А)
            { ("КВВГЭнг(А)", 4, 1.0), 0.107 },
            { ("КВВГЭнг(А)", 5, 1.0), 0.142 },
            { ("КВВГЭнг(А)", 7, 1.0), 0.159 },
            { ("КВВГЭнг(А)", 10, 1.0), 0.215 },
            { ("КВВГЭнг(А)", 14, 1.0), 0.273 },
            { ("КВВГЭнг(А)", 19, 1.0), 0.347 },
            { ("КВВГЭнг(А)", 27, 1.0), 0.473 },
            { ("КВВГЭнг(А)", 37, 1.0), 0.637 },

            { ("КВВГЭнг(А)", 4, 1.5), 0.144 },
            { ("КВВГЭнг(А)", 5, 1.5), 0.172 },
            { ("КВВГЭнг(А)", 7, 1.5), 0.195 },
            { ("КВВГЭнг(А)", 10, 1.5), 0.268 },
            { ("КВВГЭнг(А)", 14, 1.5), 0.345 },
            { ("КВВГЭнг(А)", 19, 1.5), 0.444 },
            { ("КВВГЭнг(А)", 27, 1.5), 0.628 },
            { ("КВВГЭнг(А)", 37, 1.5), 0.820 },

            { ("КВВГЭнг(А)", 4, 2.5), 0.194 },
            { ("КВВГЭнг(А)", 5, 2.5), 0.233 },
            { ("КВВГЭнг(А)", 7, 2.5), 0.273 },
            { ("КВВГЭнг(А)", 10, 2.5), 0.377 },
            { ("КВВГЭнг(А)", 14, 2.5), 0.495 },
            { ("КВВГЭнг(А)", 19, 2.5), 0.642 },
            { ("КВВГЭнг(А)", 27, 2.5), 0.913 },
            { ("КВВГЭнг(А)", 37, 2.5), 1.228 },

            { ("КВВГЭнг(А)", 4, 4.0), 0.276 },
            { ("КВВГЭнг(А)", 5, 4.0), 0.335 },
            { ("КВВГЭнг(А)", 7, 4.0), 0.397 },
            { ("КВВГЭнг(А)", 10, 4.0), 0.555 },
            { ("КВВГЭнг(А)", 14, 4.0), 0.757 },
            { ("КВВГЭнг(А)", 19, 4.0), 0.987 },
            #endregion

            #region Медные бронированные кабели ВБШвнг(А)
            // Медные бронированные кабели ВБШвнг(А)
            { ("ВБШвнг(А)", 2, 1.5), 0.331 },
            { ("ВБШвнг(А)", 2, 2.5), 0.345 },
            { ("ВБШвнг(А)", 2, 4), 0.375 },
            { ("ВБШвнг(А)", 2, 6), 0.447 },
            { ("ВБШвнг(А)", 2, 10), 0.614 },
            { ("ВБШвнг(А)", 2, 16), 0.836 },
            { ("ВБШвнг(А)", 2, 25), 1.135 },
            { ("ВБШвнг(А)", 2, 35), 1.421 },
            { ("ВБШвнг(А)", 2, 50), 1.921 },
            { ("ВБШвнг(А)", 2, 70), 2.040 },
            { ("ВБШвнг(А)", 2, 95), 2.604 },
            { ("ВБШвнг(А)", 2, 120), 3.225 },
            { ("ВБШвнг(А)", 2, 150), 3.889 },
            { ("ВБШвнг(А)", 2, 185), 4.679 },
            { ("ВБШвнг(А)", 2, 240), 5.939 },

            { ("ВБШвнг(А)", 3, 1.5), 0.340 },
            { ("ВБШвнг(А)", 3, 2.5), 0.361 },
            { ("ВБШвнг(А)", 3, 4), 0.425 },
            { ("ВБШвнг(А)", 3, 6), 0.515 },
            { ("ВБШвнг(А)", 3, 10), 0.712 },
            { ("ВБШвнг(А)", 3, 16), 0.998 },
            { ("ВБШвнг(А)", 3, 25), 1.382 },
            { ("ВБШвнг(А)", 3, 35), 1.748 },
            { ("ВБШвнг(А)", 3, 50), 2.403 },
            { ("ВБШвнг(А)", 3, 70), 2.807 },
            { ("ВБШвнг(А)", 3, 95), 3.757 },
            { ("ВБШвнг(А)", 3, 120), 4.547 },
            { ("ВБШвнг(А)", 3, 150), 5.553 },
            { ("ВБШвнг(А)", 3, 185), 6.798 },
            { ("ВБШвнг(А)", 3, 240), 8.843 },

            { ("ВБШвнг(А)", 4, 1.5), 0.348 },
            { ("ВБШвнг(А)", 4, 2.5), 0.381 },
            { ("ВБШвнг(А)", 4, 4), 0.480 },
            { ("ВБШвнг(А)", 4, 6), 0.602 },
            { ("ВБШвнг(А)", 4, 10), 0.846 },
            { ("ВБШвнг(А)", 4, 16), 1.200 },
            { ("ВБШвнг(А)", 4, 25), 1.721 },
            { ("ВБШвнг(А)", 4, 35), 2.154 },
            { ("ВБШвнг(А)", 4, 50), 3.023 },
            { ("ВБШвнг(А)", 4, 70), 3.687 },
            { ("ВБШвнг(А)", 4, 95), 4.807 },
            { ("ВБШвнг(А)", 4, 120), 5.889 },
            { ("ВБШвнг(А)", 4, 150), 7.165 },
            { ("ВБШвнг(А)", 4, 185), 9.115 },
            { ("ВБШвнг(А)", 4, 240), 11.441 },

            { ("ВБШвнг(А)", 5, 1.5), 0.359 },
            { ("ВБШвнг(А)", 5, 2.5), 0.435 },
            { ("ВБШвнг(А)", 5, 4), 0.567 },
            { ("ВБШвнг(А)", 5, 6), 0.701 },
            { ("ВБШвнг(А)", 5, 10), 1.001 },
            { ("ВБШвнг(А)", 5, 16), 1.451 },
            { ("ВБШвнг(А)", 5, 25), 2.052 },
            { ("ВБШвнг(А)", 5, 35), 2.590 },
            { ("ВБШвнг(А)", 5, 50), 3.690 },
            { ("ВБШвнг(А)", 5, 70), 4.474 },
            { ("ВБШвнг(А)", 5, 95), 5.933 },
            { ("ВБШвнг(А)", 5, 120), 7.306 },
            { ("ВБШвнг(А)", 5, 150), 9.262 },
            { ("ВБШвнг(А)", 5, 185), 11.327 },
            { ("ВБШвнг(А)", 5, 240), 14.031 },
            #endregion

            #region Контрольные медные бронированные кабели АКВБбШвнг(А)
            // Контрольные медные бронированные кабели АКВБбШвнг(А)
            { ("КВБбШвнг(А)", 4, 2.5), 0.315 },
            { ("КВБбШвнг(А)", 5, 2.5), 0.317 },
            { ("КВБбШвнг(А)", 7, 2.5), 0.328 },
            { ("КВБбШвнг(А)", 10, 2.5), 0.378 },
            { ("КВБбШвнг(А)", 14, 2.5), 0.439 },
            { ("КВБбШвнг(А)", 19, 2.5), 0.518 },
            { ("КВБбШвнг(А)", 27, 2.5), 0.650 },
            { ("КВБбШвнг(А)", 37, 2.5), 0.791 },
            #endregion

            #region Погружные кабели КПБК, КПБП, КБПП
            // Погружные кабели КПБК, КПБП, КБПП
            { ("КПБК", 3, 16), 1.015 },
            { ("КПБК", 3, 25), 1.353 },
            { ("КПБК", 3, 35), 1.662 },

            { ("КПБП", 3, 16), 1.092 },
            { ("КПБП", 3, 25), 1.439 },
            { ("КПБП", 3, 35), 1.762 },

            { ("КБПП", 3, 16), 1.17 },
            { ("КБПП", 3, 25), 1.61 },
            { ("КБПП", 3, 35), 2.1 },
            #endregion

            #region Силовые кабели 6 кВ СК
            // Силовые кабели 6 кВ СК
            { ("СК", 1, 50), 1.222 },
            { ("СК", 1, 120), 2.204 },
            { ("СК", 3, 35), 3.022 },
            { ("СК", 3, 120), 3.719 },
            #endregion

            #region Контрольные кабели по МУК ККОМ, ККОБ
            // Контрольные кабели по МУК ККОМ, ККОБ
            { ("ККОМ", 4, 1.0), 0.086 },
            { ("ККОМ", 5, 1.0), 0.116 },
            { ("ККОМ", 7, 1.0), 0.140 },
            { ("ККОМ", 10, 1.0), 0.193 },
            { ("ККОМ", 14, 1.0), 0.249 },
            { ("ККОМ", 19, 1.0), 0.321 },
            { ("ККОМ", 27, 1.0), 0.440 },
            { ("ККОМ", 37, 1.0), 0.597 },

            { ("ККОМ", 4, 1.5), 0.108 },
            { ("ККОМ", 5, 1.5), 0.142 },
            { ("ККОМ", 7, 1.5), 0.177 },
            { ("ККОМ", 10, 1.5), 0.244 },
            { ("ККОМ", 14, 1.5), 0.320 },
            { ("ККОМ", 19, 1.5), 0.415 },
            { ("ККОМ", 27, 1.5), 0.589 },
            { ("ККОМ", 37, 1.5), 0.776 },

            { ("ККОМ", 4, 2.5), 0.161 },
            { ("ККОМ", 5, 2.5), 0.198 },
            { ("ККОМ", 7, 2.5), 0.252 },
            { ("ККОМ", 10, 2.5), 0.351 },
            { ("ККОМ", 14, 2.5), 0.466 },
            { ("ККОМ", 19, 2.5), 0.611 },
            { ("ККОМ", 27, 2.5), 0.868 },
            { ("ККОМ", 37, 2.5), 1.177 },

            { ("ККОМ", 4, 4.0), 0.232 },
            { ("ККОМ", 5, 4.0), 0.288 },
            { ("ККОМ", 7, 4.0), 0.371 },
            { ("ККОМ", 10, 4.0), 0.521 },
            { ("ККОМ", 14, 4.0), 0.717 },
            { ("ККОМ", 19, 4.0), 0.943 },
            { ("ККОМ", 27, 4.0), 1.334 },

            { ("ККОБ", 4, 1.0), 0.086 },
            { ("ККОБ", 5, 1.0), 0.116 },
            { ("ККОБ", 7, 1.0), 0.140 },
            { ("ККОБ", 10, 1.0), 0.193 },
            { ("ККОБ", 14, 1.0), 0.249 },
            { ("ККОБ", 19, 1.0), 0.321 },
            { ("ККОБ", 27, 1.0), 0.440 },
            { ("ККОБ", 37, 1.0), 0.597 },

            { ("ККОБ", 4, 1.5), 0.108 },
            { ("ККОБ", 5, 1.5), 0.142 },
            { ("ККОБ", 7, 1.5), 0.177 },
            { ("ККОБ", 10, 1.5), 0.244 },
            { ("ККОБ", 14, 1.5), 0.320 },
            { ("ККОБ", 19, 1.5), 0.415 },
            { ("ККОБ", 27, 1.5), 0.589 },
            { ("ККОБ", 37, 1.5), 0.776 },

            { ("ККОБ", 4, 2.5), 0.161 },
            { ("ККОБ", 5, 2.5), 0.198 },
            { ("ККОБ", 7, 2.5), 0.252 },
            { ("ККОБ", 10, 2.5), 0.351 },
            { ("ККОБ", 14, 2.5), 0.466 },
            { ("ККОБ", 19, 2.5), 0.611 },
            { ("ККОБ", 27, 2.5), 0.868 },
            { ("ККОБ", 37, 2.5), 1.177 },

            { ("ККОБ", 4, 4.0), 0.232 },
            { ("ККОБ", 5, 4.0), 0.288 },
            { ("ККОБ", 7, 4.0), 0.371 },
            { ("ККОБ", 10, 4.0), 0.521 },
            { ("ККОБ", 14, 4.0), 0.717 },
            { ("ККОБ", 19, 4.0), 0.943 },
            { ("ККОБ", 27, 4.0), 1.334 },
            #endregion

            #region Кабели гибкие КГ
            // Кабели гибкие КГ
            { ("КГ", 3, 2.5), 0.230 },
            #endregion
        };

        public static readonly List<(string NomDiam, double RealDiam, double Weight)> WGpipeDict = new List<(string NomDiam, double RealDiam, double Weight)>()
        {
             #region Номинальный ряд трубной продукции
            // Номинальный ряд трубной продукции
            ("20", 26.8, 1.66),
            ("25", 33.5, 2.39),
            ("32", 42.3, 3.09),
            ("40", 48.0, 3.84),
            ("50", 60.0, 4.88),
            ("65", 75.5, 7.05),
            ("80", 88.5, 8.34),
            ("90", 101.3, 9.60),
            ("100", 114.0, 12.15)
            #endregion
        };

        public static readonly Dictionary<string, int> CircuitBreakerSeries = new Dictionary<string, int>
        {
            #region Ряд автоматических выключателей
            // Ряд автоматических выключателей
            { "А", 16 },
            { "Б", 25 },
            { "В", 32 },
            { "Г", 40 },
            { "Д", 63 },
            { "Е", 100 },
            { "Ж", 16 },
            { "И", 25 },
            { "К", 32 },
            { "Л", 40 },
            { "М", 63 },
            { "Н", 100 },
            { "П", 160 },
            { "Р", 250 },
            { "С", 400 },
            { "Т", 630 },
            { "У", 100 },
            { "Ф", 160 },
            { "Х", 250 },
            { "Ц", 400 },
            { "Ч", 630 },
            { "Ш", 1000 },
            { "Э", 1600 },
            { "Ю", 2500 }
            #endregion
        };
    }
}
